app/controllers/school_classes_controller.rb

  def create
    @school_class = SchoolClass.create (
      {
        title: params[:title],
        room_number: params[:room_number]
      }
    )
---
INSERT INTO "school_classes" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2020-12-11 04:32:57.186427"], ["updated_at", "2020-12-11 04:32:57.186427"]]